[
	{
		"title": "Building a Scholarship Management System with Laravel",
		"description": "A comprehensive guide to building a full-stack scholarship management platform using Laravel, MySQL, and modern web technologies.",
		"date": "2024-06-01",
		"tags": ["Laravel", "PHP", "Database Design", "Full-Stack"],
		"published": false,
		"content": "This post is currently a placeholder and will be expanded with real content soon. Check back later for insights on building scholarship management systems.\n\n## Coming Soon\n\n- Architecture and database design\n- Authentication and authorization\n- Application workflow\n- Payment processing integration\n- Lessons learned"
	},
	{
		"title": "Timesheets Management System: Lessons from Building an Internal Tool",
		"description": "Exploring the challenges and learnings from developing a comprehensive timesheet management system during my internship at Jairosoft. Insights into database design, UX for enterprise apps, and rapid prototyping.",
		"date": "2024-09-10",
		"author": "Kristee Joy Dutaro",
		"tags": ["web-development", "database-design", "enterprise-software", "internship", "lessons-learned"],
		"content": "During my internship at Jairosoft, I had the opportunity to build an internal timesheet management system from scratch. While it never made it to production as a commercial product, the experience was invaluable and taught me lessons that have shaped how I approach software development since then.\n\n## The Problem\n\nJairosoft is a software development company with multiple teams working on different projects simultaneously. The company needed a way to track employee working hours across projects, calculate billable time, and generate invoices for clients. Without a proper system, this was done manually using spreadsheets, which was error-prone and time-consuming.\n\n## The Solution\n\nI was tasked with building a timesheet management system MVP that would streamline this process. The system needed to:\n\n1. Allow employees to log their daily working hours per project\n2. Track project assignments and allocations\n3. Calculate billable time based on project rates\n4. Generate reports for project managers and accounting\n5. Support different user roles (Employee, Manager, Admin)\n\n## Architecture & Design Decisions\n\n### Database Schema\n\nThe most critical part of any timesheet system is the database design. I had to consider:\n\n- **Normalization:** Avoiding data duplication while maintaining query performance\n- **Temporal Data:** Handling date-based queries efficiently\n- **Relationships:** Proper foreign keys between employees, projects, timesheets, and billing records\n- **Audit Trail:** Maintaining a history of changes for compliance\n\nKey tables included:\n- `employees` - User information and roles\n- `projects` - Project details and billing rates\n- `timesheets` - Daily time entries\n- `project_assignments` - Employee-project mappings\n- `billing_records` - Generated invoices and billable hours\n\n### User Experience Design\n\nOne of the biggest challenges was creating an interface that was intuitive for both employees entering time and managers reviewing it. I learned that:\n\n- **Simplicity is crucial:** Timesheets are a necessary task, not an enjoyable one. The interface had to be as frictionless as possible.\n- **Validation matters:** Preventing invalid entries (negative hours, future dates, etc.) upfront saves headaches later.\n- **Visibility:** Managers needed to see their team's time at a glance, while employees needed detailed views of their own hours.\n\n### Handling Edge Cases\n\nReal-world timesheet management has many edge cases:\n\n- **Overtime:** How to handle hours beyond the standard 8-hour day\n- **Fractional hours:** Should we allow 30 minutes increments or round to nearest hour?\n- **Multiple projects in one day:** How to split time between projects fairly\n- **Corrections and adjustments:** How to handle corrections without data loss\n- **Time off (vacation, sick leave):** How to differentiate paid leave from billable hours\n\nEach of these required thoughtful implementation.\n\n## Key Technical Learnings\n\n### Database Optimization\n\n- **Indexes:** Identifying which columns to index for common queries\n- **Query optimization:** Using EXPLAIN to analyze slow queries\n- **Aggregation:** Efficiently calculating totals and summaries across months\n- **Partitioning:** How to handle growing datasets as the company scales\n\n### Business Logic Implementation\n\n- **Validation:** Complex rules for what constitutes valid time entry\n- **Calculations:** Accurate billing calculations accounting for project rates and overtime\n- **Reporting:** Aggregating data at different granularities (daily, weekly, monthly, per-project)\n\n### User Role Management\n\nDifferent roles needed different permissions and views:\n- **Employees:** Can only see and edit their own timesheets\n- **Managers:** Can see and approve their team's timesheets\n- **Admins:** Full system access for configuration and reporting\n\nImplementing this correctly required careful consideration of permission checks at both the UI and API levels.\n\n## Challenges & Solutions\n\n### Challenge 1: Time Zone Handling\n\nEmployees in different locations meant we had to handle time zones correctly. Storing all times in UTC in the database and displaying them in the user's local time zone was the solution.\n\n**Learning:** Always store temporal data in UTC and convert for display/input based on user preferences.\n\n### Challenge 2: Report Generation\n\nProject managers needed various reports (hours per project, billable hours, employee utilization, etc.). Building flexible reporting queries that could handle different date ranges and filters was complex.\n\n**Learning:** Design your database schema with reporting in mind. Consider denormalization strategically for performance.\n\n### Challenge 3: Handling Corrections\n\nEmployees sometimes noticed errors in their timesheets days later. We needed to allow corrections while maintaining an audit trail for billing purposes.\n\n**Learning:** Implement audit logging from the start. It's much harder to add later.\n\n## What I Would Do Differently\n\nReflecting on the project now, there are several things I'd approach differently:\n\n1. **Testing:** I would have invested more time in automated testing earlier, especially for the billing logic\n2. **API Design:** Following REST principles more strictly from the beginning\n3. **Documentation:** Documenting the business logic and calculation rules as I wrote them\n4. **Performance Testing:** Load testing with realistic data volumes earlier in development\n\n## Key Takeaways\n\nBuilding the timesheets management system taught me:\n\n1. **Enterprise software has unique challenges:** Real-world business requirements are complex and full of edge cases\n2. **Database design is foundational:** Poor schema design compounds problems throughout the application\n3. **User experience for business users is critical:** They need to get work done, not learn your app\n4. **Validation and error handling matter:** Most bugs in business apps come from insufficient validation\n5. **Documentation and testing save time:** Even for internal tools, these practices are worth the investment\n\nWhile the system never became a commercial product (Jairosoft eventually adopted an existing solution), the experience was invaluable. The skills I developed—working with complex data, building enterprise features, and thinking about real-world constraints—have directly applied to subsequent projects.\n\n## Current Work\n\nSince this internship experience, I've applied these learnings to various commercial projects, from the [M&S Inventory Management system](/projects/ms-inventory/) built with Next.js and Prisma, to maintaining and developing the [OneJourney Tours](/projects/onejourney-tours/) platform.\n\nThe timesheet project was a great reminder that sometimes the most valuable learning comes from building things that may not see the light of day, but teach you principles and patterns that shape your entire career.\n\n---\n\n_Have you built internal tools or worked on complex business software? I'd love to hear about your experiences. Feel free to reach out!_"
	}
]